### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_iam_policy.additional_inline[0] will be updated in-place
!   resource "aws_iam_policy" "additional_inline" {
        id        = "arn:aws:iam::350131064538:policy/tf-managed/cataprato-auth-lambda-inline"
        name      = "cataprato-auth-lambda-inline"
!       policy    = jsonencode(
!           {
!               Statement = [
!                   {
!                       Action   = [
-                           "dynamodb:UpdateItem",
-                           "dynamodb:Scan",
-                           "dynamodb:Query",
-                           "dynamodb:PutItem",
-                           "dynamodb:GetItem",
-                           "dynamodb:BatchWriteItem",
-                           "dynamodb:BatchGetItem",
                        ] -> "dynamodb:*"
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags      = {
            "Deployment" = "terraform"
        }
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-auth-lambda"
!       last_modified                  = "2023-08-17T19:44:50.000+0000" -> (known after apply)
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:35",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:29" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:29/invocations" -> (known after apply)
!       role                           = "arn:aws:iam::350131064538:role/service-role/cataprato-role-0cqzd0zs" -> "arn:aws:iam::350131064538:role/tf-managed/cataprato-auth-lambda"
!       s3_key                         = "lambda-builds/0beaad2a946a3e3af397e571f0e97b394af1e9ad8205fbc6a112e4b8d7a000e4.zip" -> "lambda-builds/70448fb6479d32250b8190420de451e3f7a562040adc1980a346e6875e26f93b.zip"
!       s3_object_version              = "KHSprt2pP4amkEV7_dN.u6jNTtyuTFR2" -> (known after apply)
        tags                           = {
            "Deployment" = "terraform"
        }
!       version                        = "29" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "29" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "12300534e9bddefd6991c26b411339b9" -> (known after apply)
!       id                     = "lambda-builds/0beaad2a946a3e3af397e571f0e97b394af1e9ad8205fbc6a112e4b8d7a000e4.zip" -> (known after apply)
!       key                    = "lambda-builds/0beaad2a946a3e3af397e571f0e97b394af1e9ad8205fbc6a112e4b8d7a000e4.zip" -> "lambda-builds/70448fb6479d32250b8190420de451e3f7a562040adc1980a346e6875e26f93b.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "./.terraform/lambda-builds/0beaad2a946a3e3af397e571f0e97b394af1e9ad8205fbc6a112e4b8d7a000e4.zip" -> "./.terraform/lambda-builds/70448fb6479d32250b8190420de451e3f7a562040adc1980a346e6875e26f93b.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "KHSprt2pP4amkEV7_dN.u6jNTtyuTFR2" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "./.terraform/lambda-builds/"
+               build_plan    = [
+                   [
+                       "set:filter",
+                       [
+                           "!app/.*",
                        ],
                    ],
+                   [
+                       "zip",
+                       "./app",
+                       null,
                    ],
+                   [
+                       "clear:filter",
                    ],
                ]
+               filename      = "./.terraform/lambda-builds/70448fb6479d32250b8190420de451e3f7a562040adc1980a346e6875e26f93b.zip"
+               runtime       = "python3.10"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "./.terraform/lambda-builds/70448fb6479d32250b8190420de451e3f7a562040adc1980a346e6875e26f93b.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "7435753079250945360" -> (known after apply)
!       triggers = {
!           "filename"  = "./.terraform/lambda-builds/0beaad2a946a3e3af397e571f0e97b394af1e9ad8205fbc6a112e4b8d7a000e4.zip" -> "./.terraform/lambda-builds/70448fb6479d32250b8190420de451e3f7a562040adc1980a346e6875e26f93b.zip"
!           "timestamp" = "1692300200679760000" -> "1692301564550883000"
        }
    }

  # module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
!       id       = "745609528415832768" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "./.terraform/lambda-builds/0beaad2a946a3e3af397e571f0e97b394af1e9ad8205fbc6a112e4b8d7a000e4.zip" -> "./.terraform/lambda-builds/70448fb6479d32250b8190420de451e3f7a562040adc1980a346e6875e26f93b.zip"
!           "original_source_code" = jsonencode(
!               [
!                   {
!                       patterns = <<-EOT
-                           !src/.*
+                           !app/.*
                        EOT
                        # (1 unchanged attribute hidden)
                    },
                ]
            )
            # (3 unchanged elements hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:35" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-17T19:25:44.928+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:35" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3" -> (known after apply)
!       s3_key                      = "builds/a06a4e350f59043b7fe444f44aa09c9aa4df1ec9f3dcc3994613b35a7ba13dd7.zip" -> "builds/0a1081efb380013e0401e05dd80e109f68251b5189e0722183efb18abf52c593.zip"
!       s3_object_version           = "xxICQcv2mXmBKZBErKdc.yVSJVUGwEsX" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "UOKojzkCLXJEnczWUA747yXg8FqMv0eEaGPMMEvUmaE=" -> (known after apply)
!       source_code_size            = 29715984 -> (known after apply)
!       version                     = "35" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "eadd340d89150f1fcde9c55f53bc014a-6" -> (known after apply)
!       id                     = "builds/a06a4e350f59043b7fe444f44aa09c9aa4df1ec9f3dcc3994613b35a7ba13dd7.zip" -> (known after apply)
!       key                    = "builds/a06a4e350f59043b7fe444f44aa09c9aa4df1ec9f3dcc3994613b35a7ba13dd7.zip" -> "builds/0a1081efb380013e0401e05dd80e109f68251b5189e0722183efb18abf52c593.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/a06a4e350f59043b7fe444f44aa09c9aa4df1ec9f3dcc3994613b35a7ba13dd7.zip" -> "builds/0a1081efb380013e0401e05dd80e109f68251b5189e0722183efb18abf52c593.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "xxICQcv2mXmBKZBErKdc.yVSJVUGwEsX" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "dist",
+                       null,
                    ],
                ]
+               filename      = "builds/0a1081efb380013e0401e05dd80e109f68251b5189e0722183efb18abf52c593.zip"
+               runtime       = ""
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/0a1081efb380013e0401e05dd80e109f68251b5189e0722183efb18abf52c593.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "8058665517414461971" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/a06a4e350f59043b7fe444f44aa09c9aa4df1ec9f3dcc3994613b35a7ba13dd7.zip" -> "builds/0a1081efb380013e0401e05dd80e109f68251b5189e0722183efb18abf52c593.zip"
!           "timestamp" = "1692300202366730000" -> "1692301566148027000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "7852732049311818433" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/a06a4e350f59043b7fe444f44aa09c9aa4df1ec9f3dcc3994613b35a7ba13dd7.zip" -> "builds/0a1081efb380013e0401e05dd80e109f68251b5189e0722183efb18abf52c593.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 10 to add, 2 to change, 8 to destroy.
```
</details>